alessandro737/stm32-vibration-monitor/src/config/FreeRTOSConfig.h
#pragma once
/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 *
 * See http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/

/* Ensure stm32f4xx is only used by the compiler, and not the assembler. */
#if defined(__GNUC__) && !defined(__ASSEMBLER__)
  #include <stm32f4xx.h>
#endif

#define configUSE_PREEMPTION						1
#define configCPU_CLOCK_HZ							( SystemCoreClock )
#define configTICK_RATE_HZ							( ( TickType_t) 1000 )
#define configMAX_PRIORITIES						( 5 )
#define configMINIMAL_STACK_SIZE					( ( unsigned short ) 256 ) // STACK_SIZE in words (4B in a word)
#define configSUPPORT_STATIC_ALLOCATION   			1
#define configSUPPORT_DYNAMIC_ALLOCATION  			0
#define configMAX_TASK_NAME_LEN						( 10 )
#define configUSE_16_BIT_TICKS						0
#define configUSE_MUTEXES							1
#define configCHECK_FOR_STACK_OVERFLOW				2
#define configUSE_RECURSIVE_MUTEXES					1
#define configUSE_APPLICATION_TASK_TAG				0
#define configGENERATE_RUN_TIME_STATS				0
#define configUSE_TIMERS							0
#define configUSE_PORT_OPTIMISED_TASK_SELECTION		1
#define configUSE_TIME_SLICING						0
#define configUSE_COUNTING_SEMAPHORES				1
#define configRECORD_STACK_HIGH_ADDRESS				1
#define configUSE_TASK_NOTIFICATIONS				1


/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */
#define INCLUDE_xSemaphoreGetMutexHolder			1
#define INCLUDE_xTaskAbortDelay						1
#define INCLUDE_vTaskDelay							1
#define INCLUDE_vTaskDelayUntil						1
#define INCLUDE_xTaskGetCurrentTaskHandle			1
#define INCLUDE_xTaskGetHandle						1
#define INCLUDE_xTaskGetIdleTaskHandle				1
#define INCLUDE_xTaskGetSchedulerState				1
#define INCLUDE_uxTaskGetStackHighWaterMark			1
#define INCLUDE_uxTaskPriorityGet					1
#define INCLUDE_vTaskPrioritySet					1
#define INCLUDE_xTaskResumeFromISR					1
#define INCLUDE_eTaskGetState						1
#define INCLUDE_vTaskSuspend						1

/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
	/* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
	#define configPRIO_BITS       		__NVIC_PRIO_BITS
#else
	#define configPRIO_BITS       		4        /* 16 priority levels */
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY			0xf

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY	5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY 		( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY 	( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
	
/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
#define configASSERT( x ) if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); __BKPT(0); for( ;; ); }

/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler SVC_Handler
#define xPortPendSVHandler PendSV_Handler
#define xPortSysTickHandler SysTick_Handler
